Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_ENETC_PF_EMDIO.h
/*! @name EMDIO_CFG - External MDIO configuration register */
/*! @{ */

#define ENETC_PF_EMDIO_EMDIO_CFG_BSY2_MASK       (0x1U)
#define ENETC_PF_EMDIO_EMDIO_CFG_BSY2_SHIFT      (0U)
/*! BSY2 - Busy 2 (same as bit 31)
 *  0b0..An MDIO transaction is not occurring; software may access other MDIO registers.
 *  0b1..An MDIO transaction is occurring.
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_BSY2(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_BSY2_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_BSY2_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_RD_ER_MASK (0x2U)
#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_RD_ER_SHIFT (1U)
/*! MDIO_RD_ER
 *  0b0..No error
 *  0b1..The last read transaction received no response from a PHY; any data read should be considered invalid
 *       (for example, the PHY address does not match any PHY available on the MDIO bus).
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_RD_ER(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_MDIO_RD_ER_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_MDIO_RD_ER_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_HOLD_MASK  (0x1CU)
#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_HOLD_SHIFT (2U)
/*! MDIO_HOLD
 *  0b000..1 NETC cycle
 *  0b001..3 NETC cycles
 *  0b010..5 NETC cycles (default - recommended value)
 *  0b011..7 NETC cycles
 *  0b100..9 NETC cycles
 *  0b101..11 NETC cycles
 *  0b110..13 NETC cycles
 *  0b111..15 NETC cycles
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_HOLD(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_MDIO_HOLD_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_MDIO_HOLD_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_PRE_DIS_MASK    (0x20U)
#define ENETC_PF_EMDIO_EMDIO_CFG_PRE_DIS_SHIFT   (5U)
/*! PRE_DIS
 *  0b0..Generation of MDIO preamble is enabled (default operation).
 *  0b1..Generation of MDIO preamble is disabled
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_PRE_DIS(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_PRE_DIS_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_PRE_DIS_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_ENC45_MASK      (0x40U)
#define ENETC_PF_EMDIO_EMDIO_CFG_ENC45_SHIFT     (6U)
/*! ENC45
 *  0b0..Clause 22 transactions are used.
 *  0b1..Clause 45 transactions are used.
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_ENC45(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_ENC45_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_ENC45_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_CLK_DIV_MASK (0xFF80U)
#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_CLK_DIV_SHIFT (7U)
/*! MDIO_CLK_DIV - MDIO Clock Divisor */
#define ENETC_PF_EMDIO_EMDIO_CFG_MDIO_CLK_DIV(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_MDIO_CLK_DIV_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_MDIO_CLK_DIV_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_WHOAMI_MASK     (0x70000U)
#define ENETC_PF_EMDIO_EMDIO_CFG_WHOAMI_SHIFT    (16U)
/*! WHOAMI - Returns the virtual port ID. */
#define ENETC_PF_EMDIO_EMDIO_CFG_WHOAMI(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_WHOAMI_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_WHOAMI_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_EHOLD_MASK      (0x400000U)
#define ENETC_PF_EMDIO_EMDIO_CFG_EHOLD_SHIFT     (22U)
/*! EHOLD - Extended HOLD
 *  0b0..Normal operation. MDIO hold time is specified in .
 *  0b1..Extended Operation
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_EHOLD(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_EHOLD_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_EHOLD_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_NEG_MASK        (0x800000U)
#define ENETC_PF_EMDIO_EMDIO_CFG_NEG_SHIFT       (23U)
/*! NEG
 *  0b0..Normal operation - positive edge
 *  0b1..MDIO is driven by master on MDC negative edge (default for external MDIOs)
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_NEG(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_NEG_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_NEG_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_ADDR_ERR_MASK   (0x10000000U)
#define ENETC_PF_EMDIO_EMDIO_CFG_ADDR_ERR_SHIFT  (28U)
/*! ADDR_ERR
 *  0b0..Normal
 *  0b1..Error. An access control violation has occurred. The request address used does not match the MDIO PHY's
 *       address (clause 22) or MDIO port address (clause 45) assigned.
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_ADDR_ERR(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_ADDR_ERR_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_ADDR_ERR_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_CIM_MASK        (0x20000000U)
#define ENETC_PF_EMDIO_EMDIO_CFG_CIM_SHIFT       (29U)
/*! CIM
 *  0b0..Masked
 *  0b1..Enabled
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_CIM(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_CIM_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_CIM_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_CMP_MASK        (0x40000000U)
#define ENETC_PF_EMDIO_EMDIO_CFG_CMP_SHIFT       (30U)
/*! CMP - MDIO Command Completion
 *  0b0..An MDIO command completion did not occur.
 *  0b1..An MDIO command completion occurred.
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_CMP(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_CMP_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_CMP_MASK)

#define ENETC_PF_EMDIO_EMDIO_CFG_BSY1_MASK       (0x80000000U)
#define ENETC_PF_EMDIO_EMDIO_CFG_BSY1_SHIFT      (31U)
/*! BSY1 - Busy 1
 *  0b0..An MDIO transaction is not occurring; software may access other MDIO registers.
 *  0b1..An MDIO transaction is occurring.
 */
#define ENETC_PF_EMDIO_EMDIO_CFG_BSY1(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CFG_BSY1_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CFG_BSY1_MASK)
/*! @} */

/*! @name EMDIO_CTL - External MDIO interface control register */
/*! @{ */

#define ENETC_PF_EMDIO_EMDIO_CTL_DEV_ADDR_MASK   (0x1FU)
#define ENETC_PF_EMDIO_EMDIO_CTL_DEV_ADDR_SHIFT  (0U)
/*! DEV_ADDR - 5-bit MDIO device address (Clause 45) / register address (Clause 22) */
#define ENETC_PF_EMDIO_EMDIO_CTL_DEV_ADDR(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CTL_DEV_ADDR_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CTL_DEV_ADDR_MASK)

#define ENETC_PF_EMDIO_EMDIO_CTL_PORT_ADDR_MASK  (0x3E0U)
#define ENETC_PF_EMDIO_EMDIO_CTL_PORT_ADDR_SHIFT (5U)
/*! PORT_ADDR - 5-bit MDIO port address (Clause 45) / PHY address (Clause 22) */
#define ENETC_PF_EMDIO_EMDIO_CTL_PORT_ADDR(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CTL_PORT_ADDR_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CTL_PORT_ADDR_MASK)

