Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_ENETC_PF_EMDIO.h
#define ENETC_PF_EMDIO_EMDIO_CTL_POST_INC_MASK   (0x4000U)
#define ENETC_PF_EMDIO_EMDIO_CTL_POST_INC_SHIFT  (14U)
/*! POST_INC - MDIO read with address post-increment initiation. Self-clearing once transaction is complete. */
#define ENETC_PF_EMDIO_EMDIO_CTL_POST_INC(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CTL_POST_INC_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CTL_POST_INC_MASK)

#define ENETC_PF_EMDIO_EMDIO_CTL_READ_MASK       (0x8000U)
#define ENETC_PF_EMDIO_EMDIO_CTL_READ_SHIFT      (15U)
/*! READ - MDIO read initiation. */
#define ENETC_PF_EMDIO_EMDIO_CTL_READ(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CTL_READ_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CTL_READ_MASK)

#define ENETC_PF_EMDIO_EMDIO_CTL_BSY_MASK        (0x80000000U)
#define ENETC_PF_EMDIO_EMDIO_CTL_BSY_SHIFT       (31U)
/*! BSY - MDIO busy */
#define ENETC_PF_EMDIO_EMDIO_CTL_BSY(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_CTL_BSY_SHIFT)) & ENETC_PF_EMDIO_EMDIO_CTL_BSY_MASK)
/*! @} */

/*! @name EMDIO_DATA - External MDIO interface data register */
/*! @{ */

#define ENETC_PF_EMDIO_EMDIO_DATA_MDIO_DATA_MASK (0xFFFFU)
#define ENETC_PF_EMDIO_EMDIO_DATA_MDIO_DATA_SHIFT (0U)
/*! MDIO_DATA - 16-bit MDIO data. */
#define ENETC_PF_EMDIO_EMDIO_DATA_MDIO_DATA(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_DATA_MDIO_DATA_SHIFT)) & ENETC_PF_EMDIO_EMDIO_DATA_MDIO_DATA_MASK)
/*! @} */

/*! @name EMDIO_ADDR - External MDIO register address register */
/*! @{ */

#define ENETC_PF_EMDIO_EMDIO_ADDR_REGADDR_MASK   (0xFFFFU)
#define ENETC_PF_EMDIO_EMDIO_ADDR_REGADDR_SHIFT  (0U)
/*! REGADDR - MDIO PHY register address. */
#define ENETC_PF_EMDIO_EMDIO_ADDR_REGADDR(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_ADDR_REGADDR_SHIFT)) & ENETC_PF_EMDIO_EMDIO_ADDR_REGADDR_MASK)
/*! @} */

/*! @name EMDIO_STAT - External MDIO status register */
/*! @{ */

#define ENETC_PF_EMDIO_EMDIO_STAT_BSY_MASK       (0x1U)
#define ENETC_PF_EMDIO_EMDIO_STAT_BSY_SHIFT      (0U)
/*! BSY - Global MDIO busy */
#define ENETC_PF_EMDIO_EMDIO_STAT_BSY(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_STAT_BSY_SHIFT)) & ENETC_PF_EMDIO_EMDIO_STAT_BSY_MASK)

#define ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_MASK  (0x1F00U)
#define ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_SHIFT (8U)
/*! WHT_LIST - PHY white list */
#define ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_SHIFT)) & ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_MASK)

#define ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_ENA_MASK (0x8000U)
#define ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_ENA_SHIFT (15U)
/*! WHT_LIST_ENA - PHY white list enable */
#define ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_ENA(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_ENA_SHIFT)) & ENETC_PF_EMDIO_EMDIO_STAT_WHT_LIST_ENA_MASK)

#define ENETC_PF_EMDIO_EMDIO_STAT_PORT_ID_MASK   (0x70000U)
#define ENETC_PF_EMDIO_EMDIO_STAT_PORT_ID_SHIFT  (16U)
/*! PORT_ID - Port ID */
#define ENETC_PF_EMDIO_EMDIO_STAT_PORT_ID(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_STAT_PORT_ID_SHIFT)) & ENETC_PF_EMDIO_EMDIO_STAT_PORT_ID_MASK)

#define ENETC_PF_EMDIO_EMDIO_STAT_REQ_TYPE_MASK  (0x80000U)
#define ENETC_PF_EMDIO_EMDIO_STAT_REQ_TYPE_SHIFT (19U)
/*! REQ_TYPE - Port ID */
#define ENETC_PF_EMDIO_EMDIO_STAT_REQ_TYPE(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_EMDIO_STAT_REQ_TYPE_SHIFT)) & ENETC_PF_EMDIO_EMDIO_STAT_REQ_TYPE_MASK)
/*! @} */

/*! @name PHY_STATUS_CFG - PHY status configuration register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_CFG_BSY_MASK   (0x1U)
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_BSY_SHIFT  (0U)
/*! BSY - MDIO busy */
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_BSY(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CFG_BSY_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CFG_BSY_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER_MASK (0x2U)
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER_SHIFT (1U)
/*! MDIO_RD_ER - MDIO read error */
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CFG_MDIO_RD_ER_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL_MASK (0xFFFF0000U)
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL_SHIFT (16U)
/*! STATUS_INTERVAL - PHY status read interval */
#define ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CFG_STATUS_INTERVAL_MASK)
/*! @} */

/*! @name PHY_STATUS_CTL - PHY status control register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR_MASK (0x1FU)
#define ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR_SHIFT (0U)
/*! DEV_ADDR - 5-bit MDIO device address (Clause 45) / register address (Clause 22) */
#define ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CTL_DEV_ADDR_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR_MASK (0x3E0U)
#define ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR_SHIFT (5U)
/*! PORT_ADDR - 5-bit MDIO port address (Clause 45) / PHY address (Clause 22) */
#define ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_CTL_PORT_ADDR_MASK)
/*! @} */

/*! @name PHY_STATUS_DATA - PHY status data register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA_MASK (0xFFFFU)
#define ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA_SHIFT (0U)
/*! MDIO_DATA - 16-bit MDIO data */
#define ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_DATA_MDIO_DATA_MASK)

#define ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT_MASK (0xFFFF0000U)
#define ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT_SHIFT (16U)
/*! CURR_CNT - Current count */
#define ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_DATA_CURR_CNT_MASK)
/*! @} */

/*! @name PHY_STATUS_ADDR - PHY status register address register */
/*! @{ */

#define ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR_MASK (0xFFFFU)
#define ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR_SHIFT (0U)
/*! REGADDR - MDIO PHY register address. Address of the register within the Clause 45 PHY device from which data is to be read. */
#define ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR(x) (((uint32_t)(((uint32_t)(x)) << ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR_SHIFT)) & ENETC_PF_EMDIO_PHY_STATUS_ADDR_REGADDR_MASK)
/*! @} */

/*! @name PHY_STATUS_EVENT - PHY status event register */
/*! @{ */

